app/Models/MasyarakatModel.php

SELECT *
FROM `masyarakat`
---
    public function getMasyarakat($id_masyarakat = null)
    {
        if ($id_masyarakat == null) {
            return $this->findAll();

SELECT *
FROM `masyarakat`
WHERE `username` = 'brataja'
AND `password` = '12344'
---
    public function login($username, $password)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('*');
        $builder->where(['username' => $username, 'password' => $password]);
        $query = $builder->get();