app/Models/PengaduanModel.php

    public function getPengaduan($from, $id_pengaduan = null)
    {
        // if ($id_pengaduan == null) {

        //     return $this->findAll();
        // }

        // return $this->where(['id_pengaduan' => $id_pengaduan])->first();


        // =======================================================================================
        $query = [];
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('*');
        $builder->join('masyarakat', 'pengaduan.id_masyarakat = masyarakat.id_masyarakat');
        if ($from === 'masyarakat') {
            $session = session();
            $id_masyarakat = $session->get('id_masyarakat');
            $builder->where([
                'pengaduan.id_masyarakat' => $id_masyarakat
            ]);
        }


        if ($id_pengaduan === null) {
            return $builder->get()->getResultArray();
---
SELECT *
FROM `pengaduan`
JOIN `masyarakat` ON `pengaduan`.`nik` = `masyarakat`.`nik`