app/Models/PetugasModel.php

SELECT *
FROM `petugas`
---
    public function getPetugas($id_petugas = null)
    {
        if ($id_petugas == null) {
            return $this->findAll();